Repository: VALAWAI/MOV
Catalog: src/main/webui/src/locale/messages.*.xlf
Languages: ca, es

# main_doctor_text
source: doctor works!
ca: La pàgina del doctor fuciona
es: La pagina del médico fuciona

# shared_not-found_title
source: Page not found
ca: Pàgina no trobada
es: Página no encontrada

# shared_not-found_message
source: The page you are looking for might have been removed, or its name changed, or it temporarily unavailable
ca: És possible que la pàgina que cerqueu s'hagi eliminat, el seu nom s'hagi canviat o que no estigui disponible temporalment
es: Es posible que la página que está buscando haya sido eliminada, haya cambiado de nombre o no esté disponible temporalmente

# shared_not-found_go-home
source: Go to home page
ca: Vés a la pàgina d'inici
es: Ir a la página de inicio

# main_components_abstract_code_get-error
source: Cannot get the component information
ca: No es pot obtenir la informació del component
es: No se puede obtener la información del componente

# main_components_register_type-label
source: Type
ca: Tipus
es: Tipo

# main_components_register_type-required-error
source: You must select the type of component.
ca: Heu de seleccionar el tipus de component.
es: Debe seleccionar el tipo de componente.

# main_components_register_name-label
source: Name
ca: Nom
es: Nombre

# main_components_register_name-placeholder
source: Ex. c0_hello_world
ca: Per exemple: c0_hola_mon
es: Por ejemplo: c0_hola_mundo

# main_components_register_name-required-error
source: You must write the name of component.
ca: Heu d'escriure el nom del component.
es: Debe escribir el nombre del componente.

# main_components_register_version-label
source: Version
ca: Versió
es: Versión

# main_components_register_version-placeholder
source: Ex. c0_hello_world
ca: Per exemple: c0_hola_mon
es: Por ejemplo: c0_hola_mundo

# main_components_register_version-required-error
source: You must write the version of component.
ca: Heu d'escriure la versió del component.
es: Debe escribir la versión del componente.

# main_components_register_version-pattern-error
source: The version must follow the pattern <b>\d+.\d+.\d+</b>.
ca: La versió ha de seguir el patró<b>\d+.\d+.\d+</b>
es: La versión debe seguir el patrón<b>\d+.\d+.\d+</b>

# main_components_register_asyncapi-version-required-error
source: You must write the aync of component.
ca: Heu d'escriure l'aync del component.
es: Debe escribir el aync del componente.

# main_components_register_register-action-label
source: Register
ca: Registrar-me
es: Registros

# main_components_register_code_page-title
source: Register a new component
ca: Registra un component nou
es: Registrar un nuevo componente

# main_components_register_code_error-message
source: Cananot register the component
ca: No és pot registrar el component
es: Cananot registrar el componente

# main_components_search-label
source: Name or description
ca: Nom o descripció
es: Nombre o descripción

# main_components_order-by-label
source: Order by
ca: Ordena per
es: Ordenar por

# main_components_order-by-type
source: Type
ca: Tipus
es: Tipo

# main_components_order-by-name
source: Name
ca: Nom
es: Nombre

# main_components_order-by-description
source: Description
ca: Descripció
es: Descripción

# main_components_order-by-reverse-label
source: In reverse order
ca: En ordre invertit
es: En orden inverso

# main_components_types-label
source: Filter components by type:
ca: Filtra els components per tipus:
es: Filtrar componentes por tipo:

# main_components_reload-label
source: <mat-icon>refresh</mat-icon> Reload
ca: <mat-icon>actualitza</mat-icon> Torna a carregar
es: <mat-icon>refresh</mat-icon> Recargar

# main_components_type-header-label
source: Type
ca: Tipus
es: Tipo

# main_components_name-header-label
source: Name
ca: Nom
es: Nombre

# main_components_description-header-label
source: Description
ca: Descripció
es: Descripción

# main_components_actions-header-label
source: Actions
ca: Accions
es: Acciones

# main_components_show-menu-label
source: Show
ca: Mostra
es: Mostrar

# main_components_unregister-menu-label
source: Unregister
ca: Donar de baixa
es: Dar de baja

# main_components_show-connections-label
source: Show connections
ca: Mostra les connexions
es: Mostrar todas las conexiones

# main_components_code_page-title
source: Components
es: Componentes

# main_components_code_get-error
source: Cannot obtain the components
ca: No es poden obtenir els components
es: No se pueden obtener los componentes

# main_components_show_go-back-label
source: Go to components
ca: Ves a components
es: Ir a componentes

# main_components_show_connections-label
source: Show connections
ca: Mostra les connexions
es: Mostrar todas las conexiones

# main_components_show_go-back-to-connection-label
source: Go to the connection
ca: Ves a la connexió
es: Ir a la conexión

# main_components_show_code_page-title
source: Show Component
ca: Mostra el component
es: Ver componente

# main_components_unregister_ok-label
source: Yes, unregister it!
ca: Sí, cancel·la el registre!
es: ¡Sí, anular el registro!

# main_components_unregister_code_page-title
source: Unregister Component
ca: Dóna de baixa el component
es: Cancelar el registro del componente

# main_components_unregister_code_success-msg
source: Unregistered the component
ca: S'ha cancel·lat el registre del component
es: No registrado el componente

# main_logs_search-mesage-label
source: Message
ca: Missatge
es: Mensaje

# main_logs_search-component-label
source: Component
es: Componente

# main_logs_order-by-label
source: Order by
ca: Ordena per
es: Ordenar por

# main_logs_order-by-timestamp
source: Timestamp
ca: Marca temporal
es: Registro de fecha

# main_logs_order-by-level
source: Level
ca: Nivell
es: Nivel

# main_logs_order-by-message
source: Message
ca: Missatge
es: Mensaje

# main_logs_order-by-component-type
source: Component type
ca: Tipus de component
es: Tipo de componente

# main_logs_order-by-component-name
source: Component name
ca: Nom del component
es: Nombre del componente

# main_logs_order-by-reverse-label
source: In reverse order
ca: En ordre invertit
es: En orden inverso

# main_logs_levels-label
source: Filter logs messages with level:
ca: El filtre registra els missatges amb el nivell:
es: Filtrar mensajes de registros con nivel:

# main_logs_component-types-label
source: Filter log messages by component type:
ca: Filtra els missatges de registre per tipus de component:
es: Filtrar mensajes de registro por tipo de componente:

# main_logs_timestamp-column-label
source: Time
ca: Temps
es: Tiempo

# main_logs_level-column-label
source: Level
ca: Nivell
es: Nivel

# main_logs_message-column-label
source: Message
ca: Missatge
es: Mensaje

# main_logs_payload-column-label
source: Payload
ca: Càrrega útil
es: Carga útil

# main_logs_component-type-column-label
source: Component type
ca: Tipus de component
es: Tipo de componente

# main_logs_component-name-column-label
source: Component name
ca: Nom del component
es: Nombre del componente

# main_logs_code_page-title
source: Logs
ca: Registres
es: Registros

# main_logs_code_get-error
source: Cannot obtain the logs
ca: No es poden obtenir els registres
es: No se pueden obtener los registros

# main_logs_dialog-level-label
source: Level
ca: Nivell
es: Nivel

# main_logs_dialog-message-label
source: Message
ca: Missatge
es: Mensaje

# main_logs_dialog-timestamp-label
source: Timestamp
ca: Marca temporal
es: Registro de fecha

# main_logs_dialog-payload-label
source: Payload
ca: Càrrega útil
es: Carga útil

# main_logs_dialog-component-type-label
source: Type
ca: Tipus
es: Tipo

# main_logs_dialog-component-name-label
source: Name
ca: Nom
es: Nombre

# main_logs_dialog-close
source: Close
ca: Tanca
es: Cerrar

# main_menu_status
source: Status
ca: Estat
es: Estado

# main_menu_components
source: Components
es: Componentes

# main_menu_topology
source: Topology
ca: Topologia
es: Topología

# main_menu_logs
source: Logs
ca: Registres
es: Registros

# main_menu-index
source: Index
ca: Índex
es: Índice

# main_menu-acknowledgement
source: Acknowledgement
ca: Reconeixement
es: Reconocimiento

# main_menu-more
source: More
ca: Més
es: Más

# main_menu_project-web-page
source: Project web page
ca: Pàgina web del projecte
es: Página web del proyecto

# main_status_version-label
source: Version:
ca: Versió:
es: Versión:

# main_status_profile-label
source: Profile:
ca: Perfil:
es: Perfil:

# main_status_health-label
source: Health:
ca: Salut:
es: Salud:

# main_status_code_page-title
source: Status
ca: Estat
es: Estado

# main_topology_connections_abstract_code_get-error
source: Cannot get the topology connection information
ca: No s'ha pogut obtenir la informació de connexió de la topologia
es: No se puede obtener la información de conexión de la topología

# main_topology_connections_change_question-disable-label
source: Are you sure the disable the connection between <b>{{connection.source?.channel?.name}}</b> and <b>{{connection.target?.channel?.name}}</b>?
ca: Estàs segur de desactivar la connexió entre <b>{{connection.source?.channel?.name}}</b> i <b>{{connection.target?.channel?.name}}</b>?
es: ¿Está seguro de deshabilitar la conexión entre <b>{{connection.source?.channel?.name}}</b> y <b>{{connection.target?.channel?.name}}</b>?

# main_topology_connections_create_cancel-label
source: Cancel
ca: Cancel·la
es: Cancelar

# main_topology_connections_change_ok-enable-label
source: Yes, enable the connection
ca: Sí, activa la connexió
es: Sí, habilitar la conexión

# main_topology_connections_change_ok-disable-label
source: Yes, disable the connection
ca: Sí, desactiva la connexió
es: Sí, desactivar la conexión

# main_topology_connections_change_ok-remove-label
source: Yes, remove the connection
ca: Sí, elimina la connexió
es: Sí, eliminar la conexión

# main_topology_connections_change_cancel-enable-label
source: No, do not enable the connection
ca: No, no habilitis la connexió
es: No, no habilitar la conexión

# main_topology_connections_change_cancel-disable-label
source: No, do not disable the connection
ca: No, no desactiveu la connexió
es: No, no deshabilitar la conexión

# main_topology_connections_change_cancel-remove-label
source: No, do not remove the connection
ca: No, no eliminis la connexió
es: No, no retire la conexión

# main_topology_connections_change_code_page-title
source: Change topology connection
ca: Canvia la connexió de la topologia
es: Cambiar conexión de topología

# main_topology_connections_change_error-message
source: Cannot update the topology connection
ca: No es pot actualitzar la connexió de topologia
es: No se puede actualizar la conexión de topología

# mmain_topology_connections_change_code_success-disable-msg
source: Disabled the topology connection
ca: S'ha desactivat la connexió de topologia
es: Desactivado la conexión de topología

# mmain_topology_connections_change_code_success-enable-msg
source: Enabled the topology connection
ca: S'ha activat la connexió de topologia
es: Habilitado la conexión de topología

# mmain_topology_connections_change_code_success-removed-msg
source: Removed the topology connection
ca: S'ha eliminat la connexió de topologia
es: Se ha eliminado la conexión de topología

# main_topology_connections_create_source-component-label
source: Source component
ca: Component font
es: Componente fuente

# main_topology_connections_create_source-channel-label
source: Source channel
ca: Canal font
es: Canal de Origen

# main_topology_connections_create_source-channel-required-error
source: You must select a source channel.
ca: Heu de seleccionar un canal d'origen.
es: Debe seleccionar un canal de origen.

# main_topology_connections_create_target-component-label
source: Target component
ca: Component objectiu
es: Componente objetivo

# main_topology_connections_create_target-channel-label
source: Target channel
ca: Canal objectiu
es: Canal de destino

# main_topology_connections_create_target-channel-required-error
source: You must select a target channel.
ca: Heu de seleccionar un canal de destinació.
es: Debe seleccionar un canal de destino.

# main_topology_connections_create_enabled-label
source: Enable the connection
ca: Habilita la connexió
es: Habilitar la conexión

# main_topology_connections_create_add-label
source: Add connection
ca: Afegeix connexió
es: Añadir conexión

# main_topology_connections_create_code_add-success
source: Added the new connection
ca: S'ha afegit la nova connexió
es: Se ha añadido la nueva conexión

# main_topology_connections_search-pattern-label
source: Source or target
ca: Origen o destinació
es: Origen o destino

# main_topology_connections_order-by-label
source: Order by
ca: Ordena per
es: Ordenar por

# main_topology_connections_order-by-source
source: Source
ca: Font
es: Fuente

# main_topology_connections_order-by-target
source: Target
ca: Meta
es: Destinó

# main_topology_connections_order-by-enabled
source: Enabled
ca: Activada
es: Habilitado

# main_topology_connections_order-by-reverse-label
source: In reverse order
ca: En ordre invertit
es: En orden inverso

# main_topology_connections_create-label
source: <mat-icon>add</mat-icon> Create a new connection
ca: <mat-icon>add</mat-icon> Crea una nova connexió
es: <mat-icon>add</mat-icon> Crear una nueva conexión

# main_topology_connections_go-back-to-component-label
source: Go to the component
ca: Ves al component
es: Ir al componente

# main_topology_connections_source-header-label
source: Source
ca: Font
es: Fuente

# main_topology_connections_target-header-label
source: Target
ca: Destinació
es: Destinó

# main_topology_connections_enabled-header-label
source: Enabled
ca: Activada
es: Habilitado

# main_topology_connections_actions-header-label
source: Actions
ca: Accions
es: Acciones

# main_topology_connections_show-menu-label
source: Show
ca: Mostra
es: Mostrar

# main_topology_connections_enable-menu-label
source: Enable
ca: Activa
es: Habilitar

# main_topology_connections_disable-menu-label
source: Disable
ca: Desactiva
es: Desactivar

# main_topology_connections_remove-menu-label
source: Remove
ca: Elimina
es: Eliminar

# main_topology_connections_code_page-title
source: Topology connections
ca: Connexions de topologia
es: Conexiones de la topología

# main_topology_connections_code_get-error
source: Cannot obtain the topology connections
ca: No es poden obtenir les connexions de topologia
es: No se pueden obtener las conexiones de topología

# main_topology_connections_show_enabled-label
source: Enabled
ca: Activada
es: Habilitado

# main_topology_connections_show_create-timestamp-label
source: Created at
ca: Creada el
es: Creado a las

# main_topology_connections_show_update-timestamp-label
source: Updated at
ca: Actualitzada a
es: Actualizado a las

# main_topology_connections_show_source-label
source: Source
ca: Font
es: Fuente

# main_topology_connections_show_node-component-label
source: Component
es: Componente

# main_topology_connections_show_node-channel-label
source: Channel
ca: Canal
es: Canal

# main_topology_connections_show_node-channel-publish-label
source: Publish
ca: Publicar
es: Publicar

# main_topology_connections_show_target-label
source: Target
ca: Destinació
es: Destinó

# main_topology_connections_show_node-channel-subscribe-label
source: Subscribe
ca: Subscriviu-vos
es: Suscribir

# main_topology_connections_show_subscriptions-label
source: Subscriptions
ca: Subscripcions
es: Suscripciones

# main_topology_connections_show_go-back-label
source: Go to connections
ca: Ves a connexions
es: Ir a conexiones

# main_topology_connections_show_go-back-to-component-connections-label
source: Go to component connections
ca: Ves a les connexions de components
es: Ir a conexiones de componentes

# main_topology_connections_show_code_page-title
source: Show topology conection
ca: Mostra la connexió de la topologia
es: Mostrar conexión de topología

# shared_component_view_type-label
source: Type
ca: Tipus
es: Tipo

# shared_component_view_version-label
source: Version
ca: Versió
es: Versión

# shared_component_view_api-version-label
source: API version
ca: Versió de l'API
es: Versión API

# shared_component_view_since-label
source: Since
ca: Des de
es: Desde

# shared_component_view_channels-label
source: Channels
ca: Canals
es: Canales

# shared_component_view_component-channel-subscribe-label
source: Subscribe
ca: Subscripció
es: Suscribir

# shared_component_view_component-channel-publish-label
source: Publish
ca: Publicar
es: Publicar

# main_components_register_name-pattern-error
source: The name must follow the pattern <b>c[0|1|2]_\w+</b>.
ca: El nom ha de seguir el patró <b>c[0|1|2]_\w+</b>
es: El nombre debe seguir el patrón <b>c[0|1|2]_\w+</b>

# main_components_unregister_question
source: Are you sure to unregister the component {{component.name}}?
ca: Segur que vols donar de baixa el component{{component.name}}?
es: ¿Seguro que desea cancelar el registro del componente{{component.name}}?

# main_components_unregister_cancel-label
source: No, do not unregister and go to the components
ca: No, no donis de baixa el component i ves a components
es: No, no lo dés de baja y ves a los componentes

# main_components_unregister_code_error-msg
source: Cannot unregister the component
ca: No es pot donar de baixa el component
es: No se puede cancelar el registro del componente

# main_logs_reload-label
source: <mat-icon>refresh</mat-icon> Reload
ca: <mat-icon> refresh </mat-icon> Torna a carregar
es: <mat-icon>refresh</mat-icon> Recargar

# main_logs_dialog-component-label
source: Component
es: Componente

# main_components_register-label
source: <mat-icon>add</mat-icon> Register a new component
ca: <mat-icon>afegeix</mat-icon> Registra un component nou
es: <mat-icon>add</mat-icon> Registrar un nuevo componente

# main_topology_connections_create_code_page-title
source: Create topology connection
ca: Crea una connexió de topologia
es: Crear conexión de topología

# main_topology_connections_create_code_add-error
source: Cannot add the new connection
ca: No es pot afegir la nova connexió
es: No se puede añadir la nueva conexión

# main_components_register_code_success-message
source: Registered the new component
ca: S'ha registrat el nou component
es: Registrado el nuevo componente

# main_logs_dialog-component-description-label
source: Description
ca: Descripció
es: Descripción

# main_acknowledgement-text
source: VALAWAI project is funded by the European Union under the European Innovation Council (EIC) research and innovation programme under Grant Agreement number 101070930.
ca: El projecte VALAWAI està finançat per la Unió Europea en el marc del programa de recerca i innovació del Consell Europeu d'Innovació (EIC) en virtut de l'acord de subvenció número 101070930.
es: El proyecto VALAWAI está financiado por la Unión Europea bajo el programa de investigación e innovación del Consejo Europeo de Innovación (EIC) bajo el Acuerdo de Subvención número 101070930.

# main_topology_connections_change_question-enable-label
source: Are you sure the enable the connection between <b>{{connection.source?.channel?.name}}</b> and <b>{{connection.target?.channel?.name}}</b>?
ca: Segur que vols habilitar la connexió entre <b>{{connection.source?.channel?.name}}</b> i <b>{{connection.target?.channel?.name}}</b>?
es: ¿Está seguro de habilitar la conexión entre <b>{{connection.source?.channel?.name}}</b> y <b>{{connection.target?.channel?.name}}</b>?

# main_topology_connections_reload-label
source: <mat-icon>refresh</mat-icon> Reload
ca: <mat-icon>refresh</mat-icon> Torna a carregar
es: <mat-icon>refresh</mat-icon> Recargar

# main_topology_connections_change_question-remove-label
source: Are you sure the remove the connection between <b>{{connection.source?.channel?.name}}</b> and <b>{{connection.target?.channel?.name}}</b>?
ca: Estàs segur d'eliminar la connexió entre <b>{{connection.source?.channel?.name}}</b> i <b>{{connection.target?.channel?.name}}</b>?
es: ¿Está seguro de eliminar la conexión entre <b>{{connection.source?.channel?.name}}</b> y <b>{{connection.target?.channel?.name}}</b>?
